province_city_list = [
    ['安徽', '安庆', '蚌埠', '池州', '滁州', '淮北', '淮南', '黄山', '六安', '马鞍山', '宿州', '铜陵', '芜湖', '宣城',
     '亳州', '合肥', '阜阳'],
    ['福建', '福州', '龙岩', '南平', '宁德', '莆田', '泉州', '三明', '厦门', '漳州'],
    ['甘肃', '兰州', '白银', '定西', '甘南', '嘉峪关', '金昌', '酒泉', '临夏', '陇南', '平凉', '庆阳', '天水', '武威',
     '张掖'],
    ['广东', '深圳', '广州', '惠州', '东莞', '佛山', '潮州', '河源', '江门', '揭阳', '茂名', '梅州', '清远', '汕头',
     '汕尾', '韶关', '阳江', '云浮', '湛江', '肇庆', '中山', '珠海'],
    ['广西', '南宁', '桂林', '百色', '北海', '崇左', '防城港', '贵港', '河池', '贺州', '来宾', '柳州', '钦州', '梧州',
     '玉林'],
    ['贵州', '贵阳', '安顺', '毕节', '六盘水', '黔东南', '黔南', '黔西南', '铜仁', '遵义'],
    ['海南', '海口', '三亚', '儋州'],
    ['河南', '郑州', '洛阳', '开封', '安阳', '鹤壁', '焦作', '南阳', '平顶山', '三门峡', '商丘', '新乡', '信阳', '许昌',
     '周口', '驻马店', '漯河', '濮阳'],
    ['湖北', '武汉', '鄂州', '黄冈', '黄石', '荆门', '荆州', '十堰', '随州', '咸宁', '襄阳', '孝感', '宜昌', '恩施'],
    ['湖南', '长沙', '张家界', '常德', '郴州', '衡阳', '怀化', '娄底', '邵阳', '湘西', '益阳', '永州', '岳阳', '株洲',
     '湘潭'],
    ['河北', '石家庄', '保定', '沧州', '承德', '邯郸', '衡水', '廊坊', '秦皇岛', '唐山', '邢台', '张家口'],
    ['黑龙江', '哈尔滨', '大庆', '大兴安岭', '鹤岗', '黑河', '鸡西', '佳木斯', '牡丹江', '七台河', '齐齐哈尔', '双鸭山',
     '绥化', '伊春'],
    ['江西', '南昌', '抚州', '赣州', '吉安', '景德镇', '九江', '萍乡', '上饶', '新余', '宜春', '鹰潭'],
    ['江苏', '南京', '苏州', '无锡', '常州', '淮安', '连云港', '南通', '宿迁', '泰州', '徐州', '盐城', '扬州', '镇江'],
    ['吉林', '长春', '吉林', '白城', '白山', '辽源', '四平', '松原', '通化', '延边'],
    ['辽宁', '沈阳', '大连', '鞍山', '本溪', '朝阳', '丹东', '抚顺', '葫芦岛', '锦州', '辽阳', '盘锦', '铁岭', '营口',
     '阜新'],
    ['内蒙古', '呼和浩特', '包头', '赤峰', '鄂尔多斯', '呼伦贝尔', '通辽', '乌海', '锡林郭勒', '兴安盟', '巴彦淖尔',
     '乌兰察布'],
    ['宁夏', '银川', '固原', '石嘴山', '吴忠', '中卫'],
    ['青海', '西宁', '海东', '海南', '海西', '玉树'],
    ['山西', '太原', '长治', '大同', '晋城', '晋中', '临汾', '吕梁', '朔州', '忻州', '阳泉', '运城'],
    ['陕西', '西安', '安康', '宝鸡', '汉中', '商洛', '铜川', '渭南', '咸阳', '延安', '榆林'],
    ['四川', '成都', '绵阳', '巴中', '达州', '德阳', '广安', '广元', '乐山', '眉山', '南充', '内江', '攀枝花', '遂宁',
     '雅安', '宜宾', '资阳', '自贡', '泸州', '凉山', '甘孜', '阿坝'],
    ['山东', '济南', '青岛', '滨州', '德州', '东营', '菏泽', '济宁', '聊城', '临沂', '日照', '泰安', '威海', '潍坊',
     '烟台', '枣庄', '淄博'],
    ['新疆', '乌鲁木齐', '克拉玛依', '吐鲁番', '哈密', '阿克苏', '喀什', '和田', '昌吉', '伊犁', '塔城', '阿勒泰'],
    ['西藏', '拉萨', '日喀则', '昌都', '林芝', '那曲', '阿里'],
    ['云南', '昆明', '普洱', '丽江', '保山', '楚雄', '大理', '红河', '曲靖', '玉溪', '昭通', '临沧', '文山', '德宏',
     '西双版纳', '迪庆', '怒江'],
    ['浙江', '杭州', '湖州', '嘉兴', '金华', '丽水', '宁波', '绍兴', '台州', '温州', '舟山', '衢州'],
    ['北京', '北京'], ['重庆', '重庆'], ['上海', '上海'], ['天津', '天津']]

city_list = []

for i in range(0, len(province_city_list)):
    j = i + 1
    for k in range(1, len(province_city_list[i])):
        tup = (str(j), str(k), province_city_list[i][k], province_city_list[i][0])
        city_list.append(tup)

print(city_list)

# city_list写入到.csv中
with open('data/city.csv', 'w', encoding='utf-8') as f:
    for i in city_list:
        f.write(','.join(i) + '\n')
